Revit 2027 API
View.GetCropRegionShapeManagerForReferenceCallout Method
 Returns an object for managing view crop region shape for reference callout.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ViewCropRegionShapeManager GetCropRegionShapeManagerForReferenceCallout(
	Document doc,
	ElementId callout
)
Public Shared Function GetCropRegionShapeManagerForReferenceCallout (
	doc As Document,
	callout As ElementId
) As ViewCropRegionShapeManager
public:
static ViewCropRegionShapeManager^ GetCropRegionShapeManagerForReferenceCallout(
	Document^ doc,
	ElementId^ callout
)
static member GetCropRegionShapeManagerForReferenceCallout :
        doc : Document *
        callout : ElementId -> ViewCropRegionShapeManager
Parameters
doc Document
 Document to which the callout belongs.
callout ElementId
 Element id of reference callout.
Return Value
ViewCropRegionShapeManager
 The crop region shape manager.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Reference callout is a view-specific element referencing another view. It can have its own crop region shape which doesn't affect the referenced view.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace